# -*- coding: utf-8 -*-
"""Копия блокнота "Практика 0.3.0.ipynb"

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/10FW0M6miDERHjBCv07ojiEG1OOrTJgVL

ФИО
"""

#Костоусов Егор Максимович

"""**Во всей практике нельзя применять библиотеки предоставляющие готовые решения!**

# **Задача 1.**

Типы данных Напишите программу на Python, которая принимает список чисел в качестве входных данных от пользователя, а затем выводит сумму, среднее значение и максимальное значение из списка.

***Нельзя использовать: len(), min(), max(), average(), sum()***

Дано:
```
1 2 3 4 5 6 7
```
Вывод:

```
Сумма чисел: 28
Среднее арифм.: 4.0
Максимальное значение: 7
```
"""

numbers = list(map(int, input("Введите числа: ").split()))

total_sum = 0
max_value = numbers[0]

for number in numbers:
    total_sum += number
    if number > max_value:
        max_value = number

count = 0
for avarage_number in numbers:
    count += 1
average = total_sum / count


print("Сумма чисел:", total_sum)
print("Среднее арифм.:", average)
print("Максимальное значение:", max_value)

"""# **Задача 2.**

Напишите программу на Python, которая принимает список слов в качестве входных данных от пользователя, а затем распечатывает список в обратном порядке.

Ввод:

```
апельсин мандарин яблоко
```

Вывод:

```
яблоко мандарин апельсин
```
"""

sl = input('Введите ваши слова:')
a = sl.split()
for b in reversed(a):
  print(b)

"""# **Задача 3**

Простой чат-бот
Создайте простого чат-бота, который отвечает на основные запросы пользователей. Программа должна использовать условные выражения для определения намерений пользователя и последующего соответствующего ответа.

Чат бот может:

- помогать складывать числа
- подсказывать фильм, музыку и тд (из заранее созданного списка)
- создавать список дел (а также выводить его, обновлять, очищать)

Интерфейс чат-бота на ваше усмотрение, это могут быть как заранее определенные команды, так и к примеру вызов команды по номеру

*Реализовать без использования функций*

Пример:

Ввод:

```
Олег, какую мызыку посоветуешь?
```

Вывод:

```
Я бы посоветовал вам: Led Zeppelin Stairway to Heaven
```
"""



"""# **Задача 4.**

Камень, ножницы, бумага

Создайте игру в Камень, ножницы, бумагу, в которой пользователь может играть против компьютера. Программа должна запросить выбор пользователя, а затем сгенерировать выбор компьютера. Затем программа должна определить победителя на основе правил игры.

**Этап 1:**

Определение победителя

**Этап 2:**
  
Игра до 3 побед


Ввод для "Этап 1":

```
Камень
```

Вывод:

```
Компьютер: Ножницы
Игрок: Камень
Победа: Игрок
```
"""

import random
pw = 0
cw = 0
while pw < 3 and cw < 3:
  hc = random.randint(1, 3)
  hp = input("Ваш ход: ")
  if hp == "К":
    hp = 1
  elif hp == "Н":
    hp = 2
  else:
    hp = 3
  if hc == 1:
    if hp == 1:
      print('Компьютер: Камень', 'Игрок: Камень', 'Ничья', sep="\n")
    elif hp == 2:
      print('Компьютер: Камень', 'Игрок: Ножницы', 'Поражение', sep="\n")
      cw += 1
    else:
      print('Компьютер: Камень', 'Игрок: Бумага', 'Победа', sep="\n")
      pw += 1
  if hc == 2:
    if hp == 1:
      print('Компьютер: Ножницы', 'Игрок: Камень', 'Победа', sep="\n")
      pw += 1
    elif hp == 2:
      print('Компьютер: Ножницы', 'Игрок: Ножницы', 'Ничья', sep="\n")
    else:
      print('Компьютер: Ножницы', 'Игрок: Бумага', 'Поражение', sep="\n")
      cw += 1
  if hc == 3:
    if hp == 1:
      print('Компьютер: Бумага', 'Игрок: Камень', 'Поражение', sep="\n")
      cw += 1
    elif hp == 2:
      print('Компьютер: Бумага', 'Игрок: Ножницы', 'Победа', sep="\n")
      pw += 1
    else:
      print('Компьютер: Бумага', 'Игрок: Бумага', 'Ничья', sep="\n")
if pw == 3:
    print("Ты набрал 3/3 и выиграл")
else:
    print("Компьютер набрал 3/3 и выиграл")

"""# **Задача 6.**

Создайте игру "Палач" или "Виселица", в которой пользователь должен угадать слово, предлагая буквы. Программа должна выбрать случайное слово, а затем разрешить пользователю угадывать буквы. После каждого угадывания программа должна сообщать пользователю, есть ли в слове буква или нет.

**Этап 1**
Создать саму игру

**Этап 2:**
Ввести подсчет количества очков и ограничения на попытки

**Этап 3:** Добавить возможность сразу угадать слово
"""



"""# **Дополнительно: Задача 7.**

**Цифра на определенном месте:**

Последовательно записан натуральный ряд чисел.

Какая цифра стоит в N позиции


Вввод:

```
Введите номер позиции: 1234567890
```

Вывод:

```
8
```
"""

